Tekla Open API Reference for Tekla Structures 2025
LoadGroup.Color Property
 The load group color. This variable indicates the color with which all loads that belong to this same group are drawn in Tekla Structures views.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LoadGroup.Colors Color { get; set; }
Public Property Color As LoadGroup.Colors
	Get
	Set
Property Value
Type: LoadGroup.Colors
See Also
Reference
LoadGroup Class
Tekla.Structures.Model Namespace